QGDsolver/tutorials/QHDFoam/2D/backwardFacingStep/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedProfile;
        profile         table
	(
	    (0 (0 0 0))
	    (0.05 (0.0285 0 0))
	    (0.1 (0.054 0 0))
	    (0.15 (0.0765 0 0))
	    (0.2 (0.096 0 0))
	    (0.25 (0.1125 0 0))
	    (0.3 (0.126 0 0))
	    (0.35 (0.1365 0 0))
	    (0.4 (0.144 0 0))
	    (0.45 (0.1485 0 0))
	    (0.5 (0.15 0 0))
	    (0.55 (0.1485 0 0))
	    (0.6 (0.144 0 0))
	    (0.65 (0.1365 0 0))
	    (0.7 (0.126 0 0))
	    (0.75 (0.1125 0 0))
	    (0.8 (0.096 0 0))
	    (0.85 (0.0765 0 0))
	    (0.9 (0.054 0 0))
	    (0.95 (0.0285 0 0))
       	    (1 (0 0 0))
	);
        direction       (0 1 0);
        origin          1;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            noSlip;
    }
    symwall
    {
        type            empty;
    }
}

// ************************************************************************* //
